Revit 2027 API
AnalyticalToPhysicalAssociationManager.GetAssociatedElementId Method
 Returns id of the element which is in association with the element with the given ElementId.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetAssociatedElementId(
	ElementId elementId
)
Public Function GetAssociatedElementId (
	elementId As ElementId
) As ElementId
public:
ElementId^ GetAssociatedElementId(
	ElementId^ elementId
)
member GetAssociatedElementId :
        elementId : ElementId -> ElementId
Parameters
elementId ElementId
 Element id for which we want to get the associated element.
Return Value
ElementId
 Id of the associated element.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AnalyticalToPhysicalAssociationManager Class
Autodesk.Revit.DB.Structure Namespace